In [2]:
import numpy as np
import pandas as pd

In [4]:
exam = pd.read_csv('./data/exam.csv')
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [5]:
exam.assign(test = np.where(exam['science']>= 60, 'pass', 'fall'))

    id  nclass  math  english  science  test
0    1       1    50       98       50  fall
1    2       1    60       97       60  pass
2    3       1    45       86       78  pass
3    4       1    30       98       58  fall
4    5       2    25       80       65  pass
5    6       2    50       89       98  pass
6    7       2    80       90       45  fall
7    8       2    90       78       25  fall
8    9       3    20       98       15  fall
9   10       3    50       98       45  fall
10  11       3    65       65       65  pass
11  12       3    45       85       32  fall
12  13       4    46       98       65  pass
13  14       4    48       87       12  fall
14  15       4    75       56       78  pass
15  16       4    58       98       65  pass
16  17       5    65       68       98  pass
17  18       5    80       78       90  pass
18  19       5    89       68       87  pass
19  20       5    78       83       58  fall

In [6]:
#p161

exam.groupby('nclass').mean()

          id   math  english  science
nclass
1        2.5  46.25    94.75    61.50
2        6.5  61.25    84.25    58.25
3       10.5  45.00    86.50    39.25
4       14.5  56.75    84.75    55.00
5       18.5  78.00    74.25    83.25

In [7]:
mpg = pd.read_csv('./data/mpg.csv')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [8]:
#p163

mpg.groupby(['manufacturer', 'drv']).agg(mean_cty = ('cty', 'mean'))

                   mean_cty
manufacturer drv
audi         4    16.818182
             f    18.857143
chevrolet    4    12.500000
             f    18.800000
             r    14.100000
dodge        4    12.000000
             f    15.818182
ford         4    13.307692
             r    14.750000
honda        f    24.444444
hyundai      f    18.642857
jeep         4    13.500000
land rover   4    11.500000
lincoln      r    11.333333
mercury      4    13.250000
nissan       4    13.750000
             f    20.000000
pontiac      f    17.000000
subaru       4    19.285714
toyota       4    14.933333
             f    21.368421
volkswagen   f    20.925926

In [9]:
mpg.query('manufacturer == "audi"').groupby(['drv']).agg(n = ('drv', 'count'))

      n
drv
4    11
f     7

In [10]:
mpg.query('manufacturer == "chevrolet"').groupby(['drv']).agg(n = ('drv', 'count'))

      n
drv
4     4
f     5
r    10

In [11]:
mpg.groupby('drv').agg(n = ('drv', 'count'))

       n
drv
4    103
f    106
r     25

In [12]:
mpg['drv'].value_counts()

drv
f    106
4    103
r     25
Name: count, dtype: int64

In [ ]:
mpg['drv'].value_counts().query('n > 100')  #시리즈 자료 구조라 query 사용할 수 없음

AttributeError: 'Series' object has no attribute 'query'

In [14]:
mpg['drv'].value_counts().to_frame('n').rename_axis('drv').query('n > 100')

       n
drv
f    106
4    103

In [ ]:
mpg.query('category == "suv"').assign(total = (mpg['hwy'] + mpg['cty'])/2)\
    .groupby('manufacturer').agg(mean_tot = ('total', 'mean'))\
    .sort_values('mean_tot', ascending=False).head()

#sql 에서는 groupby + having 이 세트인 반면, 파이썬에서는 groupby + agg 를 세트로 외우기

               mean_tot
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000
mercury       15.625000
jeep          15.562500

In [ ]:
#166 q1
mpg.groupby('category').agg(mean_cty = ('cty', 'mean'))

             mean_cty
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

In [20]:
#166 q2
mpg.groupby('category').agg(mean_cty = ('cty', 'mean')).sort_values('mean_cty', ascending=False)

             mean_cty
category
subcompact  20.371429
compact     20.127660
midsize     18.756098
minivan     15.818182
2seater     15.400000
suv         13.500000
pickup      13.000000

In [ ]:
#166 q3
mpg.groupby('manufacturer').agg(mean_hwy = ('hwy', 'mean')).head(3)

               mean_hwy
manufacturer
audi          26.444444
chevrolet     21.894737
dodge         17.945946

In [24]:
#168
#중간고사 데이터 만들기
test1 = pd.DataFrame({'id' : [1, 2,3,4,5],
                       'midterm' : [60, 80, 70, 90, 85]})
test2 = pd.DataFrame({'id' : [1,2,3,4,5],
                      'final' : [70, 83, 65, 95, 80]})

In [25]:
test1

   id  midterm
0   1       60
1   2       80
2   3       70
3   4       90
4   5       85

In [26]:
test2

   id  final
0   1     70
1   2     83
2   3     65
3   4     95
4   5     80

In [27]:
#169 데이터프레임 가로 합치기
total = pd.merge(test1, test2, how = 'left', on = 'id')
total

   id  midterm  final
0   1       60     70
1   2       80     83
2   3       70     65
3   4       90     95
4   5       85     80

In [28]:
name = pd.DataFrame({'nclass' : [1,2,3,4,5],
                     'teacher' : ['kim', 'lee', 'park', 'choi', 'jung']})
name

   nclass teacher
0       1     kim
1       2     lee
2       3    park
3       4    choi
4       5    jung

In [29]:
exam_new = pd.merge(exam, name, how='left', on='nclass')
exam_new

    id  nclass  math  english  science teacher
0    1       1    50       98       50     kim
1    2       1    60       97       60     kim
2    3       1    45       86       78     kim
3    4       1    30       98       58     kim
4    5       2    25       80       65     lee
5    6       2    50       89       98     lee
6    7       2    80       90       45     lee
7    8       2    90       78       25     lee
8    9       3    20       98       15    park
9   10       3    50       98       45    park
10  11       3    65       65       65    park
11  12       3    45       85       32    park
12  13       4    46       98       65    choi
13  14       4    48       87       12    choi
14  15       4    75       56       78    choi
15  16       4    58       98       65    choi
16  17       5    65       68       98    jung
17  18       5    80       78       90    jung
18  19       5    89       68       87    jung
19  20       5    78       83       58    jung

In [ ]:
group_a = pd.DataFrame({'id' : [1,2,3,4,5],
                       'test' : [60, 80, 70, 90, 85]})
group_b = pd.DataFrame({'id' : [1,2,3,4,5],
                      'test' : [70, 83, 65, 95, 80]})

In [31]:
group_a

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85

In [32]:
group_b

   id  test
0   1    70
1   2    83
2   3    65
3   4    95
4   5    80

In [ ]:
# 세로 합치기 할 때는 concat 사용 
group_all = pd.concat([group_a, group_b])
group_all

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85
0   1    70
1   2    83
2   3    65
3   4    95
4   5    80

#177 데이터 정제 : null 결측치, noise 이상값 제거

In [34]:
#178 
df = pd.DataFrame({'sex' : ['M', 'F', np.nan, 'M', 'F'],
                   'score' : [5,4,3,4, np.nan]})
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [35]:
#결측치 확인하기 pd.isna()

pd.isna(df)

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [36]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [37]:
df.dropna(subset=['score'])

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [39]:
df_nomiss = df.dropna(subset=['score'])
df_nomiss['score'] +1

0    6.0
1    5.0
2    4.0
3    5.0
Name: score, dtype: float64

In [47]:
df_nomiss = df.dropna(subset=['score', 'sex'])
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [48]:
df_nomiss2 = df.dropna()
df_nomiss2

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

#183 평균값으로 결측치 대체

In [52]:
exam = pd.read_csv('./data/exam.csv')
exam.loc[[2,7,14], ['math']] = np.nan  #2, 7 ,14행의 math 값에 NaN 할당
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1   NaN       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2   NaN       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4   NaN       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [54]:
exam['math'].mean()

np.float64(55.23529411764706)

In [55]:
exam['math'] = exam['math'].fillna(55)
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1  55.0       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2  55.0       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4  55.0       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [ ]:
exam['math'].isna().sum()  #결측치 빈도 확인

np.int64(0)

In [58]:
mpg = pd.read_csv('./data/mpg.csv')
mpg.loc [[62, 123, 130, 152, 211], "hwy"] = np.nan

In [61]:
mpg[['drv', 'hwy']].isna().sum()

drv    0
hwy    5
dtype: int64

In [64]:
mpg.dropna(subset=['hwy']).groupby('drv').agg(mean_hwy = ('hwy', 'mean'))

      mean_hwy
drv
4    19.222222
f    28.200000
r    21.000000

#186 이상치 정제하기

In [66]:
df = pd.DataFrame({'sex' : [1,2,1,3,2,1],
                   'score' : [5,4,3,4,2,6]})
df

   sex  score
0    1      5
1    2      4
2    1      3
3    3      4
4    2      2
5    1      6

In [ ]:
df['sex'].value_counts().sort_index()

sex
1    3
2    2
3    1
Name: count, dtype: int64

In [68]:
df['score'].value_counts().sort_index()

score
2    1
3    1
4    2
5    1
6    1
Name: count, dtype: int64

In [70]:
df['sex'] = np.where(df['sex'] == 3, np.nan, df['sex'])
df

   sex  score
0  1.0      5
1  2.0      4
2  1.0      3
3  NaN      4
4  2.0      2
5  1.0      6

In [ ]:
df['score'] = np.where(df['score'] > 5, np.nan, df['score'])  
#where를 쓰면 if & for조건 반복문 형식과 같다: 5보다 크면 nan 값으로 넣고 아니면 기존 점수 그대로 넣어라 

df

   sex  score
0  1.0    5.0
1  2.0    4.0
2  1.0    3.0
3  NaN    4.0
4  2.0    2.0
5  1.0    NaN

In [72]:
df.dropna(subset=['sex', 'score']).groupby('sex').agg(mean_score = ('score', 'mean'))

     mean_score
sex
1.0         4.0
2.0         3.0